Revit 2027 API
BackgroundProcessTaskType Constructor
Creates a new BackgroundProcessTaskType instance.
Namespace: Autodesk.Revit.DB.BackgroundProcessTask
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BackgroundProcessTaskType(
	Guid guid
)
Public Sub New (
	guid As Guid
)
public:
BackgroundProcessTaskType(
	Guid guid
)
new :
        guid : Guid -> BackgroundProcessTaskType
Parameters
guid Guid
The identifier for the BackgroundProcessTaskType.
See Also
Reference
BackgroundProcessTaskType Class
Autodesk.Revit.DB.BackgroundProcessTask Namespace